----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 24, 224, 224]             864
       BatchNorm2d-2         [-1, 24, 224, 224]              48
              ReLU-3         [-1, 24, 224, 224]               0
            Conv2d-4         [-1, 48, 224, 224]           1,152
       BatchNorm2d-5         [-1, 48, 224, 224]              96
              ReLU-6         [-1, 48, 224, 224]               0
            Conv2d-7         [-1, 12, 224, 224]           5,184
         OSAModule-8         [-1, 12, 224, 224]               0
       BatchNorm2d-9         [-1, 12, 224, 224]              24
             ReLU-10         [-1, 12, 224, 224]               0
           Conv2d-11         [-1, 48, 224, 224]             576
      BatchNorm2d-12         [-1, 48, 224, 224]              96
             ReLU-13         [-1, 48, 224, 224]               0
           Conv2d-14         [-1, 12, 224, 224]           5,184
        OSAModule-15         [-1, 12, 224, 224]               0
      BatchNorm2d-16         [-1, 12, 224, 224]              24
             ReLU-17         [-1, 12, 224, 224]               0
           Conv2d-18         [-1, 48, 224, 224]             576
      BatchNorm2d-19         [-1, 48, 224, 224]              96
             ReLU-20         [-1, 48, 224, 224]               0
           Conv2d-21         [-1, 12, 224, 224]           5,184
        OSAModule-22         [-1, 12, 224, 224]               0
      BatchNorm2d-23         [-1, 12, 224, 224]              24
             ReLU-24         [-1, 12, 224, 224]               0
           Conv2d-25         [-1, 48, 224, 224]             576
      BatchNorm2d-26         [-1, 48, 224, 224]              96
             ReLU-27         [-1, 48, 224, 224]               0
           Conv2d-28         [-1, 12, 224, 224]           5,184
        OSAModule-29         [-1, 12, 224, 224]               0
      BatchNorm2d-30         [-1, 12, 224, 224]              24
             ReLU-31         [-1, 12, 224, 224]               0
           Conv2d-32         [-1, 48, 224, 224]             576
      BatchNorm2d-33         [-1, 48, 224, 224]              96
             ReLU-34         [-1, 48, 224, 224]               0
           Conv2d-35         [-1, 12, 224, 224]           5,184
        OSAModule-36         [-1, 12, 224, 224]               0
      BatchNorm2d-37         [-1, 12, 224, 224]              24
             ReLU-38         [-1, 12, 224, 224]               0
           Conv2d-39         [-1, 48, 224, 224]             576
      BatchNorm2d-40         [-1, 48, 224, 224]              96
             ReLU-41         [-1, 48, 224, 224]               0
           Conv2d-42         [-1, 12, 224, 224]           5,184
        OSAModule-43         [-1, 12, 224, 224]               0
      BatchNorm2d-44         [-1, 12, 224, 224]              24
             ReLU-45         [-1, 12, 224, 224]               0
           Conv2d-46         [-1, 48, 224, 224]             576
      BatchNorm2d-47         [-1, 48, 224, 224]              96
             ReLU-48         [-1, 48, 224, 224]               0
           Conv2d-49         [-1, 12, 224, 224]           5,184
        OSAModule-50         [-1, 12, 224, 224]               0
         OSABlock-51         [-1, 12, 224, 224]               0
      BatchNorm2d-52         [-1, 12, 224, 224]              24
             ReLU-53         [-1, 12, 224, 224]               0
           Conv2d-54          [-1, 6, 224, 224]              72
  TransitionBlock-55          [-1, 6, 112, 112]               0
          Flatten-56                    [-1, 6]               0
           Linear-57                    [-1, 3]              21
             ReLU-58                    [-1, 3]               0
           Linear-59                    [-1, 6]              24
          Flatten-60                    [-1, 6]               0
           Linear-61                    [-1, 3]              21
             ReLU-62                    [-1, 3]               0
           Linear-63                    [-1, 6]              24
      ChannelGate-64          [-1, 6, 112, 112]               0
      ChannelPool-65          [-1, 2, 112, 112]               0
           Conv2d-66          [-1, 1, 112, 112]              98
      BatchNorm2d-67          [-1, 1, 112, 112]               2
        BasicConv-68          [-1, 1, 112, 112]               0
      SpatialGate-69          [-1, 6, 112, 112]               0
             CBAM-70          [-1, 6, 112, 112]               0
      BatchNorm2d-71          [-1, 6, 112, 112]              12
             ReLU-72          [-1, 6, 112, 112]               0
           Conv2d-73         [-1, 48, 112, 112]             288
      BatchNorm2d-74         [-1, 48, 112, 112]              96
             ReLU-75         [-1, 48, 112, 112]               0
           Conv2d-76         [-1, 12, 112, 112]           5,184
        OSAModule-77         [-1, 12, 112, 112]               0
      BatchNorm2d-78         [-1, 12, 112, 112]              24
             ReLU-79         [-1, 12, 112, 112]               0
           Conv2d-80         [-1, 48, 112, 112]             576
      BatchNorm2d-81         [-1, 48, 112, 112]              96
             ReLU-82         [-1, 48, 112, 112]               0
           Conv2d-83         [-1, 12, 112, 112]           5,184
        OSAModule-84         [-1, 12, 112, 112]               0
      BatchNorm2d-85         [-1, 12, 112, 112]              24
             ReLU-86         [-1, 12, 112, 112]               0
           Conv2d-87         [-1, 48, 112, 112]             576
      BatchNorm2d-88         [-1, 48, 112, 112]              96
             ReLU-89         [-1, 48, 112, 112]               0
           Conv2d-90         [-1, 12, 112, 112]           5,184
        OSAModule-91         [-1, 12, 112, 112]               0
      BatchNorm2d-92         [-1, 12, 112, 112]              24
             ReLU-93         [-1, 12, 112, 112]               0
           Conv2d-94         [-1, 48, 112, 112]             576
      BatchNorm2d-95         [-1, 48, 112, 112]              96
             ReLU-96         [-1, 48, 112, 112]               0
           Conv2d-97         [-1, 12, 112, 112]           5,184
        OSAModule-98         [-1, 12, 112, 112]               0
      BatchNorm2d-99         [-1, 12, 112, 112]              24
            ReLU-100         [-1, 12, 112, 112]               0
          Conv2d-101         [-1, 48, 112, 112]             576
     BatchNorm2d-102         [-1, 48, 112, 112]              96
            ReLU-103         [-1, 48, 112, 112]               0
          Conv2d-104         [-1, 12, 112, 112]           5,184
       OSAModule-105         [-1, 12, 112, 112]               0
     BatchNorm2d-106         [-1, 12, 112, 112]              24
            ReLU-107         [-1, 12, 112, 112]               0
          Conv2d-108         [-1, 48, 112, 112]             576
     BatchNorm2d-109         [-1, 48, 112, 112]              96
            ReLU-110         [-1, 48, 112, 112]               0
          Conv2d-111         [-1, 12, 112, 112]           5,184
       OSAModule-112         [-1, 12, 112, 112]               0
     BatchNorm2d-113         [-1, 12, 112, 112]              24
            ReLU-114         [-1, 12, 112, 112]               0
          Conv2d-115         [-1, 48, 112, 112]             576
     BatchNorm2d-116         [-1, 48, 112, 112]              96
            ReLU-117         [-1, 48, 112, 112]               0
          Conv2d-118         [-1, 12, 112, 112]           5,184
       OSAModule-119         [-1, 12, 112, 112]               0
        OSABlock-120         [-1, 12, 112, 112]               0
     BatchNorm2d-121         [-1, 12, 112, 112]              24
            ReLU-122         [-1, 12, 112, 112]               0
          Conv2d-123          [-1, 6, 112, 112]              72
 TransitionBlock-124            [-1, 6, 56, 56]               0
         Flatten-125                    [-1, 6]               0
          Linear-126                    [-1, 3]              21
            ReLU-127                    [-1, 3]               0
          Linear-128                    [-1, 6]              24
         Flatten-129                    [-1, 6]               0
          Linear-130                    [-1, 3]              21
            ReLU-131                    [-1, 3]               0
          Linear-132                    [-1, 6]              24
     ChannelGate-133            [-1, 6, 56, 56]               0
     ChannelPool-134            [-1, 2, 56, 56]               0
          Conv2d-135            [-1, 1, 56, 56]              98
     BatchNorm2d-136            [-1, 1, 56, 56]               2
       BasicConv-137            [-1, 1, 56, 56]               0
     SpatialGate-138            [-1, 6, 56, 56]               0
            CBAM-139            [-1, 6, 56, 56]               0
     BatchNorm2d-140            [-1, 6, 56, 56]              12
            ReLU-141            [-1, 6, 56, 56]               0
          Conv2d-142           [-1, 48, 56, 56]             288
     BatchNorm2d-143           [-1, 48, 56, 56]              96
            ReLU-144           [-1, 48, 56, 56]               0
          Conv2d-145           [-1, 12, 56, 56]           5,184
       OSAModule-146           [-1, 12, 56, 56]               0
     BatchNorm2d-147           [-1, 12, 56, 56]              24
            ReLU-148           [-1, 12, 56, 56]               0
          Conv2d-149           [-1, 48, 56, 56]             576
     BatchNorm2d-150           [-1, 48, 56, 56]              96
            ReLU-151           [-1, 48, 56, 56]               0
          Conv2d-152           [-1, 12, 56, 56]           5,184
       OSAModule-153           [-1, 12, 56, 56]               0
     BatchNorm2d-154           [-1, 12, 56, 56]              24
            ReLU-155           [-1, 12, 56, 56]               0
          Conv2d-156           [-1, 48, 56, 56]             576
     BatchNorm2d-157           [-1, 48, 56, 56]              96
            ReLU-158           [-1, 48, 56, 56]               0
          Conv2d-159           [-1, 12, 56, 56]           5,184
       OSAModule-160           [-1, 12, 56, 56]               0
     BatchNorm2d-161           [-1, 12, 56, 56]              24
            ReLU-162           [-1, 12, 56, 56]               0
          Conv2d-163           [-1, 48, 56, 56]             576
     BatchNorm2d-164           [-1, 48, 56, 56]              96
            ReLU-165           [-1, 48, 56, 56]               0
          Conv2d-166           [-1, 12, 56, 56]           5,184
       OSAModule-167           [-1, 12, 56, 56]               0
     BatchNorm2d-168           [-1, 12, 56, 56]              24
            ReLU-169           [-1, 12, 56, 56]               0
          Conv2d-170           [-1, 48, 56, 56]             576
     BatchNorm2d-171           [-1, 48, 56, 56]              96
            ReLU-172           [-1, 48, 56, 56]               0
          Conv2d-173           [-1, 12, 56, 56]           5,184
       OSAModule-174           [-1, 12, 56, 56]               0
     BatchNorm2d-175           [-1, 12, 56, 56]              24
            ReLU-176           [-1, 12, 56, 56]               0
          Conv2d-177           [-1, 48, 56, 56]             576
     BatchNorm2d-178           [-1, 48, 56, 56]              96
            ReLU-179           [-1, 48, 56, 56]               0
          Conv2d-180           [-1, 12, 56, 56]           5,184
       OSAModule-181           [-1, 12, 56, 56]               0
     BatchNorm2d-182           [-1, 12, 56, 56]              24
            ReLU-183           [-1, 12, 56, 56]               0
          Conv2d-184           [-1, 48, 56, 56]             576
     BatchNorm2d-185           [-1, 48, 56, 56]              96
            ReLU-186           [-1, 48, 56, 56]               0
          Conv2d-187           [-1, 12, 56, 56]           5,184
       OSAModule-188           [-1, 12, 56, 56]               0
        OSABlock-189           [-1, 12, 56, 56]               0
         Flatten-190                   [-1, 12]               0
          Linear-191                    [-1, 6]              78
            ReLU-192                    [-1, 6]               0
          Linear-193                   [-1, 12]              84
         Flatten-194                   [-1, 12]               0
          Linear-195                    [-1, 6]              78
            ReLU-196                    [-1, 6]               0
          Linear-197                   [-1, 12]              84
     ChannelGate-198           [-1, 12, 56, 56]               0
     ChannelPool-199            [-1, 2, 56, 56]               0
          Conv2d-200            [-1, 1, 56, 56]              98
     BatchNorm2d-201            [-1, 1, 56, 56]               2
       BasicConv-202            [-1, 1, 56, 56]               0
     SpatialGate-203           [-1, 12, 56, 56]               0
            CBAM-204           [-1, 12, 56, 56]               0
     BatchNorm2d-205           [-1, 12, 56, 56]              24
            ReLU-206           [-1, 12, 56, 56]               0
OSADenseNet_CBAM-207           [-1, 12, 56, 56]               0
 ConvTranspose2d-208         [-1, 64, 113, 113]          12,352
     BatchNorm2d-209         [-1, 64, 113, 113]             128
 ConvTranspose2d-210         [-1, 32, 225, 225]          32,800
     BatchNorm2d-211         [-1, 32, 225, 225]              64
 ConvTranspose2d-212         [-1, 32, 225, 225]          82,976
          Conv2d-213          [-1, 1, 224, 224]             129
          Conv2d-214          [-1, 1, 224, 224]             129
          Conv2d-215          [-1, 1, 224, 224]             129
          Conv2d-216          [-1, 1, 224, 224]             129
================================================================
Total params: 254,200
Trainable params: 254,200
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 769.00
Params size (MB): 0.97
Estimated Total Size (MB): 770.73
----------------------------------------------------------------
