----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 24, 224, 224]             864
       BatchNorm2d-2         [-1, 24, 224, 224]              48
              ReLU-3         [-1, 24, 224, 224]               0
            Conv2d-4         [-1, 12, 224, 224]           2,592
         OSAModule-5         [-1, 12, 224, 224]               0
       BatchNorm2d-6         [-1, 12, 224, 224]              24
              ReLU-7         [-1, 12, 224, 224]               0
            Conv2d-8         [-1, 12, 224, 224]           1,296
         OSAModule-9         [-1, 12, 224, 224]               0
      BatchNorm2d-10         [-1, 12, 224, 224]              24
             ReLU-11         [-1, 12, 224, 224]               0
           Conv2d-12         [-1, 12, 224, 224]           1,296
        OSAModule-13         [-1, 12, 224, 224]               0
      BatchNorm2d-14         [-1, 12, 224, 224]              24
             ReLU-15         [-1, 12, 224, 224]               0
           Conv2d-16         [-1, 12, 224, 224]           1,296
        OSAModule-17         [-1, 12, 224, 224]               0
      BatchNorm2d-18         [-1, 12, 224, 224]              24
             ReLU-19         [-1, 12, 224, 224]               0
           Conv2d-20         [-1, 12, 224, 224]           1,296
        OSAModule-21         [-1, 12, 224, 224]               0
      BatchNorm2d-22         [-1, 12, 224, 224]              24
             ReLU-23         [-1, 12, 224, 224]               0
           Conv2d-24         [-1, 12, 224, 224]           1,296
        OSAModule-25         [-1, 12, 224, 224]               0
      BatchNorm2d-26         [-1, 12, 224, 224]              24
             ReLU-27         [-1, 12, 224, 224]               0
           Conv2d-28         [-1, 12, 224, 224]           1,296
        OSAModule-29         [-1, 12, 224, 224]               0
         OSABlock-30         [-1, 84, 224, 224]               0
          Flatten-31                   [-1, 84]               0
           Linear-32                   [-1, 10]             850
             ReLU-33                   [-1, 10]               0
           Linear-34                   [-1, 84]             924
          Flatten-35                   [-1, 84]               0
           Linear-36                   [-1, 10]             850
             ReLU-37                   [-1, 10]               0
           Linear-38                   [-1, 84]             924
      ChannelGate-39         [-1, 84, 224, 224]               0
      ChannelPool-40          [-1, 2, 224, 224]               0
           Conv2d-41          [-1, 1, 224, 224]              98
      BatchNorm2d-42          [-1, 1, 224, 224]               2
        BasicConv-43          [-1, 1, 224, 224]               0
      SpatialGate-44         [-1, 84, 224, 224]               0
             CBAM-45         [-1, 84, 224, 224]               0
      BatchNorm2d-46         [-1, 84, 224, 224]             168
             ReLU-47         [-1, 84, 224, 224]               0
           Conv2d-48          [-1, 6, 224, 224]             504
  TransitionBlock-49          [-1, 6, 112, 112]               0
      BatchNorm2d-50          [-1, 6, 112, 112]              12
             ReLU-51          [-1, 6, 112, 112]               0
           Conv2d-52         [-1, 12, 112, 112]             648
        OSAModule-53         [-1, 12, 112, 112]               0
      BatchNorm2d-54         [-1, 12, 112, 112]              24
             ReLU-55         [-1, 12, 112, 112]               0
           Conv2d-56         [-1, 12, 112, 112]           1,296
        OSAModule-57         [-1, 12, 112, 112]               0
      BatchNorm2d-58         [-1, 12, 112, 112]              24
             ReLU-59         [-1, 12, 112, 112]               0
           Conv2d-60         [-1, 12, 112, 112]           1,296
        OSAModule-61         [-1, 12, 112, 112]               0
      BatchNorm2d-62         [-1, 12, 112, 112]              24
             ReLU-63         [-1, 12, 112, 112]               0
           Conv2d-64         [-1, 12, 112, 112]           1,296
        OSAModule-65         [-1, 12, 112, 112]               0
      BatchNorm2d-66         [-1, 12, 112, 112]              24
             ReLU-67         [-1, 12, 112, 112]               0
           Conv2d-68         [-1, 12, 112, 112]           1,296
        OSAModule-69         [-1, 12, 112, 112]               0
      BatchNorm2d-70         [-1, 12, 112, 112]              24
             ReLU-71         [-1, 12, 112, 112]               0
           Conv2d-72         [-1, 12, 112, 112]           1,296
        OSAModule-73         [-1, 12, 112, 112]               0
      BatchNorm2d-74         [-1, 12, 112, 112]              24
             ReLU-75         [-1, 12, 112, 112]               0
           Conv2d-76         [-1, 12, 112, 112]           1,296
        OSAModule-77         [-1, 12, 112, 112]               0
         OSABlock-78         [-1, 84, 112, 112]               0
          Flatten-79                   [-1, 84]               0
           Linear-80                   [-1, 10]             850
             ReLU-81                   [-1, 10]               0
           Linear-82                   [-1, 84]             924
          Flatten-83                   [-1, 84]               0
           Linear-84                   [-1, 10]             850
             ReLU-85                   [-1, 10]               0
           Linear-86                   [-1, 84]             924
      ChannelGate-87         [-1, 84, 112, 112]               0
      ChannelPool-88          [-1, 2, 112, 112]               0
           Conv2d-89          [-1, 1, 112, 112]              98
      BatchNorm2d-90          [-1, 1, 112, 112]               2
        BasicConv-91          [-1, 1, 112, 112]               0
      SpatialGate-92         [-1, 84, 112, 112]               0
             CBAM-93         [-1, 84, 112, 112]               0
      BatchNorm2d-94         [-1, 84, 112, 112]             168
             ReLU-95         [-1, 84, 112, 112]               0
           Conv2d-96          [-1, 6, 112, 112]             504
  TransitionBlock-97            [-1, 6, 56, 56]               0
      BatchNorm2d-98            [-1, 6, 56, 56]              12
             ReLU-99            [-1, 6, 56, 56]               0
          Conv2d-100           [-1, 12, 56, 56]             648
       OSAModule-101           [-1, 12, 56, 56]               0
     BatchNorm2d-102           [-1, 12, 56, 56]              24
            ReLU-103           [-1, 12, 56, 56]               0
          Conv2d-104           [-1, 12, 56, 56]           1,296
       OSAModule-105           [-1, 12, 56, 56]               0
     BatchNorm2d-106           [-1, 12, 56, 56]              24
            ReLU-107           [-1, 12, 56, 56]               0
          Conv2d-108           [-1, 12, 56, 56]           1,296
       OSAModule-109           [-1, 12, 56, 56]               0
     BatchNorm2d-110           [-1, 12, 56, 56]              24
            ReLU-111           [-1, 12, 56, 56]               0
          Conv2d-112           [-1, 12, 56, 56]           1,296
       OSAModule-113           [-1, 12, 56, 56]               0
     BatchNorm2d-114           [-1, 12, 56, 56]              24
            ReLU-115           [-1, 12, 56, 56]               0
          Conv2d-116           [-1, 12, 56, 56]           1,296
       OSAModule-117           [-1, 12, 56, 56]               0
     BatchNorm2d-118           [-1, 12, 56, 56]              24
            ReLU-119           [-1, 12, 56, 56]               0
          Conv2d-120           [-1, 12, 56, 56]           1,296
       OSAModule-121           [-1, 12, 56, 56]               0
     BatchNorm2d-122           [-1, 12, 56, 56]              24
            ReLU-123           [-1, 12, 56, 56]               0
          Conv2d-124           [-1, 12, 56, 56]           1,296
       OSAModule-125           [-1, 12, 56, 56]               0
        OSABlock-126           [-1, 84, 56, 56]               0
         Flatten-127                   [-1, 84]               0
          Linear-128                   [-1, 10]             850
            ReLU-129                   [-1, 10]               0
          Linear-130                   [-1, 84]             924
         Flatten-131                   [-1, 84]               0
          Linear-132                   [-1, 10]             850
            ReLU-133                   [-1, 10]               0
          Linear-134                   [-1, 84]             924
     ChannelGate-135           [-1, 84, 56, 56]               0
     ChannelPool-136            [-1, 2, 56, 56]               0
          Conv2d-137            [-1, 1, 56, 56]              98
     BatchNorm2d-138            [-1, 1, 56, 56]               2
       BasicConv-139            [-1, 1, 56, 56]               0
     SpatialGate-140           [-1, 84, 56, 56]               0
            CBAM-141           [-1, 84, 56, 56]               0
     BatchNorm2d-142           [-1, 84, 56, 56]             168
            ReLU-143           [-1, 84, 56, 56]               0
OSADenseNet_CBAM-144           [-1, 84, 56, 56]               0
 ConvTranspose2d-145         [-1, 64, 113, 113]          86,080
     BatchNorm2d-146         [-1, 64, 113, 113]             128
 ConvTranspose2d-147         [-1, 32, 225, 225]          32,800
     BatchNorm2d-148         [-1, 32, 225, 225]              64
 ConvTranspose2d-149         [-1, 32, 225, 225]          82,976
          Conv2d-150          [-1, 1, 224, 224]             129
          Conv2d-151          [-1, 1, 224, 224]             129
          Conv2d-152          [-1, 1, 224, 224]             129
          Conv2d-153          [-1, 1, 224, 224]             129
================================================================
Total params: 243,604
Trainable params: 243,604
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 498.19
Params size (MB): 0.93
Estimated Total Size (MB): 499.88
----------------------------------------------------------------
